### **Pandas Index Explained**
- **pandas is a best friend to a data scientist, and index is the invisible soul behind pandas**

> **Business Problem**: Classification(a person earns more than 50K or less)
> **Predictor Variable:** label; **Predictors:** country, age, education, occupation, marital status etc.

The following Notebook is very easy to follow and also has small tips and
tricks to make daily work a little better.

In [1]:
import pandas as pd

In [55]:
adult = pd.read_csv("adult.data", names = ['age','workclass','fnlwgt', 'education', 'education_num',
                                           'marital_status','occupation','relationship','race','sex',
                                           'capital_gain','capital_loss', 'hours_per_week', 
                                           'native_country','label'], index_col = False)
print("Shape of data{}".format(adult.shape))

adult.head()

Shape of data(32561, 15)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,label
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [3]:
#adult.columns = ['age','workclass','fnlwgt', 'education',    'education_num','marital_status','occupation','relationship','race','sex','capital_gain','capital_loss', 'hours_per_week', 'native_country','label']
#adult.head()

- Let's look at some more information.

In [4]:
adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education_num     32561 non-null int64
marital_status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital_gain      32561 non-null int64
capital_loss      32561 non-null int64
hours_per_week    32561 non-null int64
native_country    32561 non-null object
label             32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

- Selection methods

1. df.loc are for labels/names
2. df.iloc are for position numbers

Before we understand **loc&iloc** more, let's take a sample from our data for further analysis.
We are taking a sample of 10000 observations, using pandas df.sample method.

In [38]:
df = adult.sample(10000, random_state= 100).sort_index(axis = 0)
df.head(3)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,label
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K

- 补充：来看看 random_state 这个参数

```python
SVC(random_state=0)里有参数 random_state

from imblearn.over_sampling import SMOTE
SMOTE(random_state=42) 里有参数 random_state
```

**random_state**相当于随机数种子，下面会有代码来解释其作用。上面设置random.seed()就相当于在scv中设置了random_state.

没有设置random.seed(),每次取得的结果就不一样，它的随机数种子与当前系统时间有关。

In [39]:
import random
for i in range(5):
    print(random.randint(1, 100))

91
51
94
45
56

- 再运行一遍上面的代码得到：

In [40]:
import random
for i in range(5):
    print(random.randint(1, 100))

65
15
69
16
11

- 加入random.seed()

In [41]:
import random
random.seed(100)
for i in range(5):
    print(random.randint(1, 100))

19
59
59
99
23

 - 再重复一次

In [42]:
import random
random.seed(100)
for i in range(5):
    print(random.randint(1, 100))

print("发现，结果一样")

19
59
59
99
23
发现，结果一样

**其实这个种子就是一个控制器，控制每次的随机。所以在smote中， 因为要随机采样，设置了这个参数以后，每次随机的结果是一样的，这样很有用，控制住了不必要的变量。**

Naming our index will help us a little initially, its the indices from adult dataset.
look at the rows and column indices

In [43]:
df.index.name = 'index_adult'

In [44]:
df.index

Int64Index([    3,     4,     6,     8,    11,    12,    16,    23,    26,
               29,
            ...
            32525, 32526, 32529, 32536, 32541, 32542, 32543, 32548, 32550,
            32556],
           dtype='int64', name='index_adult', length=10000)

In [45]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education_num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'label'],
      dtype='object')

In [46]:
df.index.name

'index_adult'

> Both rows and columns have indexes, and the name of index is 'index_adult'

Let's discuss a couple of examples on **loc&iloc** methods

In [47]:
#df.loc[2, ['age']] # Try replace 3, 4 instead of 2

KeyError: 'the label [2] is not in the [index]'

In [48]:
df.iloc[2,0]

49

- For our further analysis, let's keep a few interesting variables only

In [49]:
cols = ['age', 'education', 'marital_status', 'occupation', 'race', 'sex', 'native_country', 'label']
df = df[cols]
df.head(2)

,age,education,marital_status,occupation,race,sex,native_country,label
index_adult,,,,,,,,
3,53,11th,Married-civ-spouse,Handlers-cleaners,Black,Male,United-States,<=50K
4,28,Bachelors,Married-civ-spouse,Prof-specialty,Black,Female,Cuba,<=50K

- **‘reset_index()’** will recreate index column every time we run it on same data
- **'drop = True'** paramater won't create that as column in the dataframe, look at the difference
between following two dataset.
- **'inplace = True'** save us from assigning it to data again

In [50]:
df.reset_index().head(2)

,index_adult,age,education,marital_status,occupation,race,sex,native_country,label
0,3,53,11th,Married-civ-spouse,Handlers-cleaners,Black,Male,United-States,<=50K
1,4,28,Bachelors,Married-civ-spouse,Prof-specialty,Black,Female,Cuba,<=50K

In [51]:
df.reset_index(drop= True).head(2)

,age,education,marital_status,occupation,race,sex,native_country,label
0,53,11th,Married-civ-spouse,Handlers-cleaners,Black,Male,United-States,<=50K
1,28,Bachelors,Married-civ-spouse,Prof-specialty,Black,Female,Cuba,<=50K

In [52]:
df.reset_index(inplace= True)
df.head(2)

,index_adult,age,education,marital_status,occupation,race,sex,native_country,label
0,3,53,11th,Married-civ-spouse,Handlers-cleaners,Black,Male,United-States,<=50K
1,4,28,Bachelors,Married-civ-spouse,Prof-specialty,Black,Female,Cuba,<=50K

- **Filtering**
Filter on india

In [65]:
ind = df[df.native_country == ' India']
ind.head(2)

,index_adult,age,education,marital_status,occupation,race,sex,native_country,label
4,11,30,Bachelors,Married-civ-spouse,Prof-specialty,Asian-Pac-Islander,Male,India,>50K
312,1029,48,Masters,Married-spouse-absent,Sales,Asian-Pac-Islander,Male,India,<=50K

let's look at the observations with more than 50K income across the gender

- pandas.crosstab（交叉表）
- pandas.crosstab(index, columns, values=None, rownames=None, colnames=None, aggfunc=None, margins=False, margins_name='All', dropna=True, normalize=False)[source]
- Compute a simple cross-tabulation of two (or more) factors. By default computes a frequency table of the factors unless an array of values and an aggregation function are passed

In [72]:
#知识点补充：
foo = pd.Categorical(['a', 'b'], categories=['a', 'b', 'c'])
bar = pd.Categorical(['d', 'e'], categories=['d', 'e', 'f'])
pd.crosstab(foo, bar)  # 'c' and 'f' are not represented in the data, 
# but they still will be counted in the output
#结果略有不同，参见
#https://pandas.pydata.org/pandas-docs/version/0.23.4/generated/pandas.crosstab.html

col_0  d  e
row_0
a      1  0
b      0  1

In [67]:
cross = pd.crosstab(ind.sex, ind.label)
cross

label     <=50K   >50K
sex
 Female       4      0
 Male        16     17

In [68]:
cross.index

Index([' Female', ' Male'], dtype='object', name='sex')

> Even this dataframe has an index, hard to recognise by the dataframe, and individual items can be accessed like

In [73]:
cross.loc[' Male']

label
 <=50K    16
 >50K     17
Name:  Male, dtype: int64

- Filter ind dataset for people with income more than 50K

In [74]:
ind_50 = ind[ind['label'] == ' >50K']
ind_50.head()

,index_adult,age,education,marital_status,occupation,race,sex,native_country,label
4,11,30,Bachelors,Married-civ-spouse,Prof-specialty,Asian-Pac-Islander,Male,India,>50K
2467,8124,36,Prof-school,Never-married,Prof-specialty,Other,Male,India,>50K
3063,9939,43,Prof-school,Married-civ-spouse,Prof-specialty,Asian-Pac-Islander,Male,India,>50K
3265,10590,35,Prof-school,Never-married,Prof-specialty,Asian-Pac-Islander,Male,India,>50K
3285,10661,59,Prof-school,Married-civ-spouse,Prof-specialty,Asian-Pac-Islander,Male,India,>50K

> indices are intact with their rows, just like an address

very Impressive, these people are earning really good, Let's try to konw 
their work hours since we don't have 'hours_per_week' in this data, we will
bring it from adult with the help of indices

In [75]:
adult['hours_per_week'][ind_50.index_adult]

11       40
8124     40
9939     50
10590    40
10661    40
13551    40
16923    60
17834    50
21128    50
24154    50
25739    40
26356    40
28264    70
28433    55
28452    40
28798    50
31327    60
Name: hours_per_week, dtype: int64

> Indices made it very easy to bring more information easily, the above formula
can be understood as filtering adult['hours_per_week']on the address
index_adult of ind_50

mean of work hours per week for people who earn more than 50k

In [76]:
adult['hours_per_week'][ind_50.index_adult].mean()

47.94117647058823

**one last use of the index for this intro exercise**
- Filtering a complementary set from the data, just like train and test from the total dataset
- we are slicing that part of ind, ehich is not in ind_50, i.e.people who are earning less than 50K

In [78]:
ind_05 = ind[~ind.index.isin(ind_50.index)]
ind_05.head()

,index_adult,age,education,marital_status,occupation,race,sex,native_country,label
312,1029,48,Masters,Married-spouse-absent,Sales,Asian-Pac-Islander,Male,India,<=50K
637,2130,28,11th,Separated,Adm-clerical,Asian-Pac-Islander,Female,India,<=50K
902,2989,44,Masters,Married-civ-spouse,Exec-managerial,Asian-Pac-Islander,Male,India,<=50K
1365,4480,30,Bachelors,Married-civ-spouse,Sales,Asian-Pac-Islander,Male,India,<=50K
1379,4523,57,Bachelors,Married-civ-spouse,Prof-specialty,Asian-Pac-Islander,Male,India,<=50K

In [79]:
adult['hours_per_week'][ind_05.index_adult].mean()

38.7

**Nice! It looks like people who earn 50K & more, work more hours per week in this data sample**